{
	"title": {
		"media": {
			"url": "https://collectorshive.com/blog/wp-content/uploads/2023/09/131124012659-manny-pacquiao-rios-win.jpg",
			"caption": "The man who left home as a teenager and became world-famous boxer.",
			"credit": "flickr/<a href='https://collectorshive.com/blog/2023/09/29/manny-pacquiao-memorabilla-and-collectoble-items/'>Pac-Man</a>"
		},
		"text": {
			"headline": "Manny Pacquiao <br/> Professional Boxer",
			"text": "<p>Born on December 17, 1978 in Kibawe, Bukidnon province, Mindanao, Philippines. He is a Professional Boxer, Media Celebrity and Politician. He became World-Famous for winning Boxing Titles in more weight classes than any boxer in History.</p>"
		}
	},
	"events": [
		{
			"media": {
				"url": "https://miro.medium.com/v2/resize:fit:1280/1*_L8g4LaemfvgWBdJ04AzaQ.jpeg",
				"caption": "University of Montreal researchers published \"A Neural Probabilistic Language Model,\" which suggested a method to model language using feed-forward neural networks.",
				"credit": "View Here: <a href='https://medium.com/@dahami/a-neural-probabilistic-language-model-breaking-down-bengios-approach-4bf793a84426'>More Details</a><br/>"
			},
			"start_date": {
				
				"year": "2000"
			},
			"text": {
				"headline": "A Neural Probabilistic Language Model",
				"text": "<p>authored by researchers at the Université de Montréal—notably Yoshua Bengio, Réjean Ducharme, Pascal Vincent, and Christian Jauvin—and it proposed modeling language using a feed‑forward neural network, introducing the now‑classic technique of learning distributed word representations alongside a neural network to predict word sequences.</p>"
			}
		},
		{
			"media": {
				"url": "https://images.deepai.org/glossary-terms/854031bd4add48b3b493bdb43a2dc0df/torch.png",
				"caption": "First open source machine learning library"
			},
			"start_date": {
				"month" : "10",
				"year": "2002"
			},
			"text": {
				"headline": "Torch",
				"text": "Open-source machine learning library and scientific computing framework developed by the Idiap Research Institute at EPFL. It utilizes the Lua programming language, specifically LuaJIT, to provide high-performance interfaces to deep learning algorithms implemented in C."
			}
		},
		{
			"media": {
				"url": "https://opendatascience.com/wp-content/uploads/2018/12/kaggle.png",
				"caption": "A Free, All‑In‑One Platform for Data Science Learning, Collaboration, and Competition",
				"credit": "<a href='https://www.datacamp.com/blog/what-is-kaggle'>Learn More.</a>"

			},
			"start_date": {
				"month": "10",
				"year": "2010"
			},
			"text": {
				"headline": "Kaggle",
				"text": "Kaggle is an online community and platform founded in 2010 (now part of Google) that enables data scientists to collaborate, share datasets, compete in machine learning challenges, and run code in cloud-based notebooks powered by free GPUs and TPUs. Users get a weekly allocation—typically 30 hours of GPU time and 20 hours of TPU time—for building, training, and experimenting within a ready-to-use environment. Its scoring and medal systems place users on public leaderboards, fostering learning, visibility, and career opportunities through recognition and performance."
			}
		},
		{
			"media": {
				"url": "https://cdn.mos.cms.futurecdn.net/d560dd3b2f6eb03708dcfb9664884142.jpg",
				"caption": "Microsoft's Kinect: Revolutionizing Gaming with Motion-Sensing Technology"
				
			},
			"start_date": {
				"month":"11",
				"year": "2010"
			},
			"text": {
				"headline": "Kinect",
				"text": "Microsoft's Kinect, released for the Xbox 360 in November 2010, was a groundbreaking motion-sensing device that enabled controller-free gaming and interaction. It utilized a combination of hardware and software to track human movement and respond to voice commands, offering a new level of immersion in gaming and entertainment."
			}
		},		
		{
			"media": {
				"url": "https://imageio.forbes.com/specials-images/imageserve/646b79ddea957a74f200fd8a/0x0.jpg?format=jpg&height=600&width=1200&fit=bounds",
				"caption": "Schmidhuber’s team built the first CNN to beat humans at visual recognition",
				"credit": "<a href='https://people.idsia.ch/~juergen/superhumanpatternrecognition3.html'>Learn More.</a>"
			},
			"start_date": {
				"year": "2011"
			},
			"text": {
				"headline": "First Superhuman Visual Pattern Recognition",
				"text": "A team led by Jürgen Schmidhuber—together with Dan Claudiu Ciresan, Ueli Meier, and Jonathan Masci—built a type of deep learning model (a convolutional neural network) that beat human performance at recognizing traffic signs. In the 2011 IJCNN Traffic Sign Recognition contest, their model made just 0.56% mistakes, which is about half the error rate of people, who made 1.16% mistakes on average. This was not only better than humans but also clearly ahead of other computer methods."
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=6CjWhlP6_TQ",
				"caption": "Marquez lands 'the perfect punch,' ending their rivalry in explosive fashion.",
				"credit": "<a href='https://www.espn.ph/boxing/story/_/id/8786726/manny-pacquiao-juan-manuel-marquez-iv'>More Details</a>"
			},
			"start_date": {
				"year": "2012"
			},
			"text": {
				"headline": "Fight of the Decade",
				"text": "Manny Pacquiao and Juan Manuel Márquez met for the fourth—and final—time on December 8, 2012, at the MGM Grand Garden Arena in Las Vegas in a highly charged welterweight showdown billed as the “Fight of the Decade.” Márquez sealed the dramatic affair with a stunning overhand right that knocked Pacquiao out with just one second remaining in the sixth round"
			}
		},
		{
			"media": {
				"url": "https://www.si.com/.image/t_share/MTY4MTg1NjUwOTk4NjgzMDA4/mayweather-vs-pacquiao-3jpg.jpg",
				"caption": "Floyd Mayweather Jr. outboxes Manny Pacquiao over 12 rounds to win a unanimous decision, solidifying his legacy as one of boxing's all-time greats.",
				"credit": "<a href='https://www.youtube.com/watch?v=gVCE3K2UEDQ#:~:text=On%20May%202%2C%202015%2C%20Floyd%20Mayweather%20and,fights%20in%20boxing%20history%20at%20the%20MGM'>YouTube Video </a>"
			},
			"start_date": {
				"year": "2015"
			},
			"text": {
				"headline": "The Battle for Greatness",
				"text": "Floyd Mayweather Jr. and Manny Pacquiao finally squared off on May 2, 2015, at the MGM Grand Garden Arena in Las Vegas. Mayweather—leveraging superior defense, a sharp jab, and precise counters—secured a unanimous decision victory"
			}
		},
		{
			"media": {
				"url": "https://www.youtube.com/watch?v=ykBY6GbI6lU",
				"caption": "Manny Pacquiao's Return to the Ring",
				"credit": "MGM Grand Garden Arena in Las Vegas"
			},
			"start_date": {
				"month" : "7",
				"day" : "19",
				"year": "2025"
			},
			"text": {
				"headline": "A Draw with Mario Barrios",
				"text": "Manny Pacquiao made a remarkable return to the ring at age 46, facing WBC welterweight champion Mario Barrios. Despite his age and a four-year hiatus, Pacquiao showcased his signature speed and skill, earning a majority draw with scorecards of 115–113 for Barrios and two at 114–114. This performance earned him the No. 9 spot in Ring Magazine's welterweight rankings, sparking discussions about a potential rematch or future bouts against other top contenders."
			}
		}	
	]
}
